#!/usr/bin/python
# -*- coding: utf-8 -*-

import os

import requests

os.system("/var/www/crm/crmkill");

body = '2000188475889;2000188475872;2000188475841;12321'

body = 'ЦБ000000242;ЦБ000000241;ЦБ000000238'

json = '{"head": "ПРИЛОЖЕНИЕ", "base": 2, "id": ["00000000249", "00000000069", "ЦБ000000238"]}'
json = '{"head": "ПРИЛОЖЕНИЕ", "base": 1, "id": ["T1TEST"]}'
#json = '{"head": "ПРИЛОЖЕНИЕ к накладной № ЦБИПК000017 от 26.07.2017", "base": 1, "id": ["ЦБ000000242", "ЦО000000206", "ЦБ000000241", "ЦБ000000238"]}'

#header = {'crc': '123', 'token': '456'}

json = '{"head": "test", "base": 1, "id": ["ЦО000000291","ЦБ000000106","ЦБ000000107","00000000052","ЦБ000000108","ЦБ000000193","ЦБ000000048","ЦБ000000089","ЦБ000000087","ЦО000000945","00000000016","ЦБ000000016","ЦБ000000081","ЦО000000931","ЦО000000930","ЦО000000937","ЦБ000000079","ЦБ000000014","ЦБ000000013","ЦБ000000360"]}'

json = '{"base": "2","head": "ПРИЛОЖЕНИЕ к накладной № 116","id": ["УТ000002461","УТ000002381"]}'



r = requests.post("http://crm.babah24.ru/api1c/get/cert", data=json)
print r.text[:5000]